/*
 Localizable.strings
 SetappDownloader
 
 Created by tanlan on 24.02.17.
 Copyright © 2017 MacPaw. All rights reserved.
 */

// Status Text
"StatusTextFieldAppDownloading" = "Downloading…";
"StatusTextFieldAppInstalling" = "Installing…";
"StatusTextFieldAppReady" = "Installation completed";

// Incomplete Installing Alert
"IncompleteInstallAlertTitle" = "Installation still in progress";
"IncompleteInstallAlertDescription" = "Are you sure you want to quit before the process is completed?";
"IncompleteInstallAlertDefaultButton" = "Continue Installation";
"IncompleteInstallAlertAlterButton" = "Quit";

// Installation Failed Alert
"FailedInstallAlertTitle" = "An error occurred during installation.";
"FailedInstallAlertDefaultDescription" = "Please make sure you have Internet connection and try again.";
"FailedInstallAlertDefaultButton" = "Try Again";
"FailedInstallAlertDirectDownloadButton" = "Direct Download";
"FailedInstallAlertAlterButton" = "Quit";

// Installation Permission Error Alert
"InstallationPermissionsAlertTitle" = "Setapp cannot continue installing due to a lack of permissions.";
"InstallationPermissionsAlertDefaultDescription" = "Please try again and allow the required changes.";
"InstallationPermissionsAlertDefaultButton" = "Try Again";
"InstallationPermissionsAlertAlterButton" = "Quit";

// Onboarding texts
"FirstScreenTitle" = "Your %@ is a part of Setapp";
"FirstScreenDescription" = "Which means you get way more than just %@. Setapp is a collection of top-notch software for Mac, all ready to use.";
"FirstScreenDescriptionCMMX" = "Which means a next-gen cleaner is not the only thing you get. Setapp is a collection of top-notch software, all ready to use.";

"SecondScreenTitle" = "Explore your\nnew apps";
"SecondScreenDescription" = "Any app on Setapp can be installed to your Mac in seconds. You can use all the apps for free for 7 days.";

"ThirdScreenTitle" = "Let yourself be\nsurprised";
"ThirdScreenDescription" = "Some of the apps solve problems you never thought could be solved. Browse around and get ready to discover your next favorite software.";

"SetappInstallationScreenTitle" = "Unwrap your app\ncollection";
"SetappInstallationScreenDescription" = "Open Setapp for the first time and let yourself get carried away. The apps you discover will surprise you.";

"PackScreenTitle" = "Your new apps are a part of Setapp";
"PackScreenDescription" = "You get way more than just %@.\nSetapp is a huge collection of stunning Mac apps, all yours.";
"PackLaunchButtonTitle" = "Go to Pack";

"GiftScreenTitle" = "Enjoy perfecting your\nMac with %@";
"GiftScreenDescription" = "It will always be yours within Setapp, active\nsubscription not required.";
"GiftLaunchButtonTitle" = "Go to %@";

// Menu texts
"QuitAppMenuTitle" = "Quit %@";
"AboutAppMenuTitle" = "About %@";
"HideAppMenuTitle" = "Hide %@";
